In [1]:
import pandas as pd
import numpy as np

In [2]:
[1, 2, 3] + [4, 5, 6]

[1, 2, 3, 4, 5, 6]

In [3]:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series([4, 5, 6])

In [4]:
print(s1)
print(s2)

0    1
1    2
2    3
dtype: int64
0    4
1    5
2    6
dtype: int64

In [10]:
s3 = pd.concat([s1, s2], ignore_index=True)
s3

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [12]:
def make_df(cols, ind):
    data = {
        c: [str(c) + str(i) for i in ind] for c in cols
    }
    return pd.DataFrame(data, ind)

In [13]:
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [14]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
df1

    A   B
1  A1  B1
2  A2  B2

In [15]:
df2

    A   B
3  A3  B3
4  A4  B4

In [16]:
pd.concat([df1, df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [20]:
df3 = make_df('AB', [1, 2])
df4 = make_df('CD', [1, 2])

pd.concat([df3, df4], axis='columns')

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [22]:
x = df1.copy()
y = df2.copy()

y.index = x.index

x

    A   B
1  A1  B1
2  A2  B2

In [23]:
y

    A   B
1  A3  B3
2  A4  B4

In [25]:
dup_df = pd.concat([x, y])
dup_df

    A   B
1  A1  B1
2  A2  B2
1  A3  B3
2  A4  B4

In [29]:
try:
    pd.concat([x, y], verify_integrity=True)
except ValueError as e:
    print(e)

Indexes have overlapping values: Int64Index([1, 2], dtype='int64')

In [30]:
pd.concat([x, y], ignore_index=True)

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

In [32]:
multi_df = pd.concat([x, y], keys=['x', 'y'])
multi_df

      A   B
x 1  A1  B1
  2  A2  B2
y 1  A3  B3
  2  A4  B4

In [34]:
multi_df.loc['x']

    A   B
1  A1  B1
2  A2  B2

In [35]:
df1

    A   B
1  A1  B1
2  A2  B2

In [36]:
df2

    A   B
3  A3  B3
4  A4  B4

In [37]:
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [38]:
# One-To-One
df1 = pd.DataFrame({
    "name": ['Bob', 'Alice', 'Eve'],
    "group": ['A', 'B', 'B']
})
df2 = pd.DataFrame({
    "name": ['Bob', 'Alice', 'Eve'],
    "number": [1, 2, 3]
})

In [39]:
df1

    name group
0    Bob     A
1  Alice     B
2    Eve     B

In [40]:
df2

    name  number
0    Bob       1
1  Alice       2
2    Eve       3

In [41]:
pd.merge(df1, df2)

    name group  number
0    Bob     A       1
1  Alice     B       2
2    Eve     B       3

In [47]:
# Many-to-One
df3 = pd.DataFrame({
    'group': ['A', 'B', 'C'],
    'skills': ['math', 'programming', 'biology']
})

In [48]:
df3

  group       skills
0     A         math
1     B  programming
2     C      biology

In [49]:
pd.merge(df1, df3)

    name group       skills
0    Bob     A         math
1  Alice     B  programming
2    Eve     B  programming

In [50]:
df4 = pd.DataFrame({
    'group': ['A', 'B', 'B'],
    'leaders': ['Jack', 'John', 'Jill']
})
df4

  group leaders
0     A    Jack
1     B    John
2     B    Jill

In [51]:
pd.merge(df1, df4)

    name group leaders
0    Bob     A    Jack
1  Alice     B    John
2  Alice     B    Jill
3    Eve     B    John
4    Eve     B    Jill

In [52]:
df2

    name  number
0    Bob       1
1  Alice       2
2    Eve       3

In [53]:
pd.merge(df2, df3)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False